In [2]:
from hossam import load_data
from pandas import DataFrame

In [4]:
df = load_data("game_scores")
df

[data] https://data.hossam.kr/data/lab05/game_scores.xlsx
[desc] 최근 열린 게임 토너먼트 경기 결과 데이터 (인덱스와 메타데이터 없음)
[!] Cannot read metadata

    player  stage1  stage2  stage3
0    Alice      85    92.0    88.0
1      Bob      78     NaN    95.0
2  Charlie      90    88.0    91.0
3    David      82    85.0     NaN
4      Eva      95    98.0    99.0

In [6]:
df1 = df.dropna()
df2= df1.set_index('player')
df3 = DataFrame(df2.stack())
df3

                   0
player
Alice   stage1  85.0
        stage2  92.0
        stage3  88.0
Charlie stage1  90.0
        stage2  88.0
        stage3  91.0
Eva     stage1  95.0
        stage2  98.0
        stage3  99.0

In [8]:
df4 = df3.reset_index()
df4.filter(['player', 0]).groupby('player').mean()

                 0
player
Alice    88.333333
Charlie  89.666667
Eva      97.333333